In [1]:
%pip install pandas as pd

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement as (from versions: none)
ERROR: No matching distribution found for as

In [2]:
import pandas as pd
import numpy as np

In [7]:
df=pd.read_csv('sample_employees.csv')
df.head()
df.tail()

   id     name department   salary   age       city
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [4]:
df.isnull().sum()

id            0
name          0
department    0
salary        1
age           1
city          0
dtype: int64

In [6]:
df.isna().any()

id            False
name          False
department    False
salary         True
age            True
city          False
dtype: bool